doom-config/.config/doom/doom-config.org
** add our own packages
and Here we add the packages want installed
#+begin_src emacs-lisp :tangle "~/.config/doom/packages.el" :mkdirp yes
;; text
(package! adoc-mode)
(package! tldr)
(package! edit-indirect)
(package! link-hint)
(package! symbol-overlay)
(package! pomm)
(package! org-appear)

;; misc
(package! format-all)
(package! keycast)
(package! evil-string-inflection)
(package! all-the-icons-ibuffer)
(package! dired-narrow)
(package! git-link)
(package! magit-delta)
(package! citre)
(package! imenu-list)

;; programming
(package! bazel-mode :recipe (:host github :repo "bazelbuild/emacs-bazel-mode"))
(package! graphql-mode)
(package! protobuf-mode)
(when (modulep! :tools lsp +eglot)
  (package! breadcrumb :recipe (:host github :repo "joaotavora/breadcrumb"))
  (package! eglot-java)
  )
(when (not (modulep! :tools lsp +eglot))
  (package! lsp-docker))
#+end_src

* Autoload Functions
in this part, we define some functions that get autoloaded
** Buffer Functions
#+begin_src emacs-lisp :tangle "~/.config/doom/autoload/buffer.el" :mkdirp yes
;;; ~/.doom.d/autoload/buffer.el -*- lexical-binding: t; -*-

;;;###autoload
(defun revert-buffer-no-confirm ()
  "Revert buffer without confirmation."
  (interactive)
  (save-buffer)
  (revert-buffer :ignore-auto :noconfirm))

;;;###autoload
(defun reload-buffer-no-confirm ()
  "Reload buffer without confirmation."
  (interactive)
  (save-buffer)
  (let ((f buffer-file-name))
    (kill-this-buffer)
    (find-file f)))

;;;###autoload
(defun indent-buffer ()
  "Indent the currently visited buffer."
  (interactive)
  (indent-region (point-min) (point-max)))

;;;###autoload
(defun indent-region-or-buffer ()
  "Indent a region if selected, otherwise the whole buffer."
  (interactive)
  (save-excursion
    (if (region-active-p)
        (progn
          (indent-region (region-beginning) (region-end))
          (message "Indented selected region."))
      (progn
        (indent-buffer)
        (message "Indented buffer.")))))

;;;###autoload
(defun +my/untabify-buffer ()
  (interactive)
  (save-excursion
    (untabify (point-min) (point-max)) nil))

;;;###autoload
(defun +my/hidden-dos-eol ()
  "Do not show ^M in files containing mixed UNIX and DOS line endings."
  (interactive)
  (setq buffer-display-table (make-display-table))
  (aset buffer-display-table ?\^M []))

;;;###autoload
(defun +my/remove-dos-eol ()
  "Replace DOS eolns CR LF with Unix eolns CR"
  (interactive)
  (goto-char (point-min))
  (while (search-forward "\r" nil t) (replace-match "")))

;;;###autoload
(defun +my/insert-semicolon-at-the-end-of-this-line ()
  (interactive)
  (save-excursion
    (end-of-line)
    (insert ";")))

;;;###autoload
(defun +my/delete-semicolon-at-the-end-of-this-line ()
  (interactive)
  (save-excursion
    (end-of-line)
    (when (looking-back ";")
      (backward-char)
      (delete-char 1))))

;;;###autoload
(defun +my/check-large-buffer ()
  "Check if the buffer is large."
  (when (> (buffer-size) 1048576)       ; 1MB
    t))

;;;###autoload
(defun +my/find-file-check-make-large-file-read-only-hook ()
  "If a file is over a given size, make the buffer read only."
  (when (+my/check-large-buffer)
    (setq-local buffer-read-only t)
    (buffer-disable-undo)
    (fundamental-mode)))

;;;###autodef
(defun lsp! ()
  "Dispatch to call the currently used lsp client entrypoint"
  (interactive)
  (unless (+my/check-large-buffer)
    (if (modulep! :tools lsp +eglot)
        (eglot-ensure)
      (unless (bound-and-true-p lsp-mode)
        (lsp-deferred)))))

;;;###autodef
(defun +lsp/restart ()
  (interactive)
  (if (modulep! :tools lsp +eglot)
      (call-interactively 'eglot-reconnect)
    (call-interactively 'lsp-workspace-restart)))
#+end_src

** Git Functions
#+begin_src emacs-lisp :tangle "~/.config/doom/autoload/git.el" :mkdirp yes
;;; autoload/git.el -*- lexical-binding: t; -*-

;;;###autoload
(defun +vc/git-browse-commit (arg)
  "Open the website for the current version controlled file. Fallback to
repository root."
  (interactive "P")
  (require 'git-link)
  (let ((git-link-open-in-browser (not arg)))
    (git-link-commit (git-link--select-remote))))

;;;###autoload
(defun git-link-github-http (hostname dirname filename branch commit start end)
  (format "http://%s/%s/blob/%s/%s"
          hostname
          dirname
          (or branch commit)
          (concat filename
                  (when start
                    (concat "#"
                            (if end
                                (format "L%s-%s" start end)
                              (format "L%s" start)))))))

;;;###autoload
(defun git-link-commit-github-http (hostname dirname commit)
  (format "http://%s/%s/commit/%s"
          hostname
          dirname
          commit))

(defun magit-blame-get-hash ()
  "Code copied from magit-blame-copy-hash"
  (oref (magit-current-blame-chunk) orig-rev))

;;;###autoload
(defun magit-blame--git-link-commit (arg)
  "Git link commit go to current line's magit blame's hash"
  (interactive "P")
  (require 'git-link)
  (cl-letf (((symbol-function 'word-at-point)
             (symbol-function 'magit-blame-get-hash)))
    (let ((git-link-open-in-browser (not arg)))
      (git-link-commit (git-link--read-remote)))))


(defvar forge-show-all-issues-and-pullreqs t
  "If nil, only show issues and pullreqs assigned to me.")

;;;###autoload
(defun +my/forge-toggle-all-issues-and-pullreqs ()
  "Toggle the forge section which only shows the issues and pullreqs assigned to me."
  (interactive)
  (setq forge-insert-default '(forge-insert-pullreqs forge-insert-issues))
  (setq forge-insert-assigned '(forge-insert-assigned-pullreqs forge-insert-assigned-issues))
  (if forge-show-all-issues-and-pullreqs
      (progn
        (setq forge-show-all-issues-and-pullreqs nil)
        (remove-hook! 'magit-status-sections-hook #'forge-insert-issues nil t)
        (remove-hook! 'magit-status-sections-hook #'forge-insert-pullreqs nil t)
        (magit-add-section-hook 'magit-status-sections-hook 'forge-insert-assigned-pullreqs nil t)
        (magit-add-section-hook 'magit-status-sections-hook 'forge-insert-assigned-issues nil t))
    (progn
      (setq forge-show-all-issues-and-pullreqs t)
      (remove-hook! 'magit-status-sections-hook #'forge-insert-assigned-issues nil t)
      (remove-hook! 'magit-status-sections-hook #'forge-insert-assigned-pullreqs nil t)
      (magit-add-section-hook 'magit-status-sections-hook 'forge-insert-pullreqs nil t)
      (magit-add-section-hook 'magit-status-sections-hook 'forge-insert-issues nil t)))

  ;; refresh magit-status buffer
  (magit-refresh))

#+end_src

