doom-config/.config/doom/doom-config.org
** Prog Functions
#+begin_src emacs-lisp :tangle "~/.config/doom/autoload/prog.el" :mkdirp yes
;;; ~/.doom.d/autoload/prog.el -*- lexical-binding: t; -*-

(defun my/realgud-eval-nth-name-forward (n)
  (interactive "p")
  (save-excursion
    (let (name)
      (while (and (> n 0) (< (point) (point-max)))
        (let ((p (point)))
          (if (not (c-forward-name))
              (progn
                (c-forward-token-2)
                (when (= (point) p) (forward-char 1)))
            (setq name (buffer-substring-no-properties p (point)))
            (cl-decf n 1))))
      (when name
        (realgud:cmd-eval name)
        nil))))

(defun my/realgud-eval-nth-name-backward (n)
  (interactive "p")
  (save-excursion
    (let (name)
      (while (and (> n 0) (> (point) (point-min)))
        (let ((p (point)))
          (c-backward-token-2)
          (when (= (point) p) (backward-char 1))
          (setq p (point))
          (when (c-forward-name)
            (setq name (buffer-substring-no-properties p (point)))
            (goto-char p)
            (cl-decf n 1))))
      (when name
        (realgud:cmd-eval name)
        nil))))

(defun my/realgud-eval-region-or-word-at-point ()
  (interactive)
  (when-let*
      ((cmdbuf (realgud-get-cmdbuf))
       (process (get-buffer-process cmdbuf))
       (expr
        (if (evil-visual-state-p)
            (let ((range (evil-visual-range)))
              (buffer-substring-no-properties (evil-range-beginning range)
                                              (evil-range-end range)))
          (word-at-point)
          )))
    (with-current-buffer cmdbuf
      (setq realgud:process-filter-save (process-filter process))
      (set-process-filter process 'realgud:eval-process-output))
    (realgud:cmd-eval expr)
    ))

(defun +my//realtime-elisp-doc-function ()
  (-when-let* ((w (selected-window))
               (s (intern-soft (current-word))))
    (describe-symbol s)
    (select-window w)))

;;;###autoload
(defun +my/realtime-elisp-doc ()
  (interactive)
  (when (eq major-mode 'emacs-lisp-mode)
    (if (advice-function-member-p #'+my//realtime-elisp-doc-function eldoc-documentation-function)
        (remove-function (local 'eldoc-documentation-function) #'+my//realtime-elisp-doc-function)
      (add-function :after-while (local 'eldoc-documentation-function) #'+my//realtime-elisp-doc-function))))

;;;###autoload
(defun +my/realgud-eval-nth-name-forward (n)
  (interactive "p")
  (save-excursion
    (let (name)
      (while (and (> n 0) (< (point) (point-max)))
        (let ((p (point)))
          (if (not (c-forward-name))
              (progn
                (c-forward-token-2)
                (when (= (point) p) (forward-char 1)))
            (setq name (buffer-substring-no-properties p (point)))
            (cl-decf n 1))))
      (when name
        (realgud:cmd-eval name)))))

;;;###autoload
(defun +my/realgud-eval-nth-name-backward (n)
  (interactive "p")
  (save-excursion
    (let (name)
      (while (and (> n 0) (> (point) (point-min)))
        (let ((p (point)))
          (c-backward-token-2)
          (when (= (point) p) (backward-char 1))
          (setq p (point))
          (when (c-forward-name)
            (setq name (buffer-substring-no-properties p (point)))
            (goto-char p)
            (cl-decf n 1))))
      (when name
        (realgud:cmd-eval name)))))

;;;###autoload
(defun async-shell-command-no-window (command)
  "Requisite Documentation"
  (interactive)
  (let
      ((display-buffer-alist
        (list
         (cons
          "\\*Async Shell Command\\*.*"
          (cons #'display-buffer-no-window nil)))))
    (async-shell-command
     command nil nil)))

;;;###autoload
(defadvice async-shell-command-no-window (around auto-confirm compile activate)
  (cl-letf (((symbol-function 'yes-or-no-p) (lambda (&rest args) t))
            ((symbol-function 'y-or-n-p) (lambda (&rest args) t)))
    ad-do-it))

;;;###autoload
(defun display-which-function ()
  (interactive)
  (message (which-function)))
#+end_src

** Text Functions
#+begin_src emacs-lisp :tangle "~/.config/doom/autoload/text.el" :mkdirp yes
;;; autoload/text.el -*- lexical-binding: t; -*-

(defun +my/markdown-highlight ()
  "Surround each line of the current REGION with a start/end tag."
  (interactive)
  (let ((delim "=="))
    (markdown--insert-common delim delim markdown-regex-bold 2 4 'markdown-bold-face t)))

;;;###autoload
(defun +my/markdown-highlight-using-html-mark ()
  "Surround each line of the current REGION with a start/end tag."
  (interactive)
  (require 'web-mode)
  (when mark-active
    (let (beg end line-beg line-end pos tag tag-start tag-end)
      (save-excursion
        (combine-after-change-calls
          (setq tag "mark"
                tag-start (concat "<" tag ">")
                tag-end (concat "</" tag ">")
                pos (point)
                beg (region-beginning)
                end (region-end)
                line-beg (web-mode-line-number beg)
                line-end (web-mode-line-number end))
          (goto-char end)
          (unless (bolp)
            (insert tag-end)
            (back-to-indentation)
            (when (> beg (point))
              (goto-char beg))
            (insert tag-start))
          (while (> line-end line-beg)
            (forward-line -1)
            (setq line-end (1- line-end))
            (unless (looking-at-p "[[:space:]]*$")
              (end-of-line)
              (insert tag-end)
              (back-to-indentation)
              (when (> beg (point))
                (goto-char beg))
              (insert tag-start))
            )                           ;while
          (deactivate-mark)
          )                             ;combine-after-change-calls
        )                               ;save-excursion
      )))
#+end_src

** Private modules
*** lazycat
**** autoload
#+begin_src emacs-lisp :tangle "~/.config/doom/modules/private/lazycat/autoload/lazycat.el" :mkdirp yes
;;; private/lazycat/autoload/lazycat.el -*- lexical-binding: t; -*-

;;;###autoload
(defun +my/search-project ()
  (interactive)
  (if current-prefix-arg
      (color-rg-search-project)
    (+default/search-project)))

#+end_src

**** config.el
#+begin_src emacs-lisp :tangle "~/.config/doom/modules/private/lazycat/config.el" :mkdirp yes
;;; private/lazycat/config.el -*- lexical-binding: t; -*-

(map! :leader
      :desc "Snails" :nmv "RET" #'snails
      (:prefix "s"
       :desc "Search project" "p" #'+my/search-project
       :desc "Search project customly" "P" #'color-rg-customized-search))

(set-popup-rules! '(("^\\*color-rg\\*$" :size 0.35)))

(use-package! color-rg
  :defer t
  :custom (color-rg-mac-load-path-from-shell nil)
  :commands color-rg-search-project
  :config
  ;; https://emacs.stackexchange.com/a/10588/22102
  (evil-make-overriding-map color-rg-mode-map 'normal)
  ;; force update evil keymaps after git-timemachine-mode loaded
  (add-hook 'color-rg-mode-hook #'evil-normalize-keymaps)

  (map! (:map color-rg-mode-map
         "j" nil "k" nil "l" nil "h" nil
         "C-k" #'color-rg-jump-prev-keyword
         "C-j" #'color-rg-jump-next-keyword
         :nv "gr" #'color-rg-rerun)
        (:map color-rg-mode-edit-map
         "C-c C-k" #'color-rg-quit))

  (custom-set-faces!
    `(color-rg-font-lock-match :foreground ,(doom-color 'red))
    `(color-rg-font-lock-header-line-text :foreground ,(doom-color 'dark-cyan))
    `(color-rg-font-lock-function-location :foreground ,(doom-color 'magenta))
    `(color-rg-font-lock-header-line-keyword :foreground ,(doom-color 'magenta))
    `(color-rg-font-lock-header-line-edit-mode :foreground ,(doom-color 'magenta))))


(when (display-graphic-p)
  (use-package! snails
    :defer t
    :custom (snails-use-exec-path-from-shell nil)
    :load-path  "~/.config/emacs/.local/straight/repos/snails"
    :commands snails
    :config
    (setq snails-input-buffer-text-scale 1)
    (set-evil-initial-state!
      '(snails-mode)
      'insert)
    (map!
     (:map snails-mode-map
      :nvi "C-g" #'snails-quit
      :nvi "ESC ESC ESC" #'snail-quit
      :nvi "C-n" #'snails-select-next-item
      :nvi "C-p" #'snails-select-prev-item
      :nvi "C-v" #'snails-select-next-backend
      :nvi "M-v" #'snails-select-prev-backend
      :nvi "RET" #'snails-candidate-do
      :nvi "C-RET" #'snails-candiate-alternate-do))
    )

  (use-package! fuz
    :defer t
    :config
    (unless (require 'fuz-core nil t)
      (fuz-build-and-load-dymod))))

#+end_src

**** packages.el
#+begin_src emacs-lisp :tangle "~/.config/doom/modules/private/lazycat/packages.el" :mkdirp yes
;; -*- no-byte-compile: t; -*-
;;; private/lazycat/packages.el

(package! color-rg :recipe (:host github :repo "manateelazycat/color-rg"))
(package! snails :recipe (:host github :repo "manateelazycat/snails"))
(package! fuz :recipe (:host github :repo "rustify-emacs/fuz.el"))

#+end_src

*** my-checker
**** autoload
#+begin_src emacs-lisp :tangle "~/.config/doom/modules/private/my-checker/autoload/checker.el" :mkdirp yes
;;; private/my-checker/autoload/checker.el -*- lexical-binding: t; -*-

;;;###autoload
(defun reset-flycheck (&rest _)
  (flycheck-mode -1)
  (flycheck-mode +1))

;;;###autoload
(defun occur-non-ascii ()
  "Find any non-ascii characters in the current buffer."
  (interactive)
  (occur "[^[:ascii:]]"))

;;add count for chinese, mainly used for writing chinese blog post
;; http://kuanyui.github.io/2014/01/18/count-chinese-japanese-and-english-words-in-emacs/
(defvar wc-regexp-english-word
  "[a-zA-Z0-9-]+")


#+end_src

**** config.el
#+begin_src emacs-lisp :tangle "~/.config/doom/modules/private/my-checker/config.el" :mkdirp yes
;;; private/my-checker/config.el -*- lexical-binding: t; -*-

(if (modulep! :checkers syntax)
    (map! :leader
          (:prefix-map ("e" . "error")
           :desc "Next error"      "n" #'flycheck-next-error
           :desc "Previous error"  "p" #'flycheck-previous-error
           :desc "Explain error"   "e" #'flycheck-explain-error-at-point
           :desc "List errors"     "l" #'flycheck-list-errors
           :desc "Lsp list errors" "L" #'consult-lsp-diagnostics
           :desc "Verify setup"    "v" #'flycheck-verify-setup))
  (map! :leader
        (:prefix-map ("e" . "error")
         :desc "Next error"      "n" #'flymake-goto-next-error
         :desc "Previous error"  "p" #'flymake-goto-prev-error
         :desc "Explain error"   "e" #'flymake-show-diagnostic
         :desc "List errors"     "l" #'flymake-show-diagnostics-buffer
         :desc "Lsp list errors" "L" #'consult-flymake
         :desc "List project error" "P" #'flymake-show-project-diagnostics
         :desc "Verify setup"    "v" #'flymake-running-backends)))


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; FLYCHECK
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; (use-package! wucuo
;;   :defer t
;;   :init
;;   (add-hook! (js2-mode rjsx-mode go-mode c-mode c++-mode) #'wucuo-start))


(after! flycheck
  (setq-default flycheck-disabled-checkers
                '(
                  typescript-tslint javascript-jshint handlebars
                  eglot json-jsonlist json-python-json
                  c/c++-clang c/c++-cppcheck c/c++-gcc c/c++-googlelint
                  python-mypy python-pylint python-pycompile
                  ;; Disable Perl for Coral Config file
                  perl
                  ))

  ;; customize flycheck temp file prefix
  (setq-default flycheck-temp-prefix ".flycheck")

  ;; ======================== JS & TS ========================
  ;; https://github.com/hlissner/doom-emacs/blob/c2f8476c8641fcc9a1371d873ed3b5924952a059/modules/lang/javascript/config.el#L109

  ;; ======================== CC ========================
  (require 'flycheck-google-cpplint)
  (setq flycheck-c/c++-googlelint-executable "cpplint")
  (flycheck-add-next-checker 'c/c++-gcc '(t . c/c++-googlelint))

  (setq flycheck-c/c++-gcc-executable "gcc-7"
        flycheck-gcc-include-path '("/usr/local/inclue"))

  (add-hook! c++-mode-hook
    (setq flycheck-gcc-language-standard "c++11"
          flycheck-clang-language-standard "c++11"))
  )

;; (defun disable-flycheck-mode ()
;;   (flycheck-mode -1))
;; (add-hook! (emacs-lisp-mode) 'disable-flycheck-mode)
#+end_src

**** packages.el
#+begin_src emacs-lisp :tangle "~/.config/doom/modules/private/my-checker/packages.el" :mkdirp yes
;; -*- no-byte-compile: t; -*-
;;; private/my-checker/packages.el

;; (package! wucuo)
(when (modulep! :checkers syntax)
  (package! flycheck-google-cpplint :recipe (:host github :repo "flycheck/flycheck-google-cpplint")))

#+end_src

*** my-python
