doom-config/.config/doom/doom-config.org
**** config.el
#+begin_src emacs-lisp :tangle "~/.config/doom/modules/private/my-python/config.el" :mkdirp yes
;;; private/my-python/config.el -*- lexical-binding: t; -*-

(map!
 (:after python
  :localleader
  :map python-mode-map
  :desc "Insert breakpoint" "b" #'+python/toggle-breakpoint
  :desc "Insert default breakpoint" "B" #'+python/toggle-default-breakpoint
  :desc "Toggle debugpy lines" "d" #'+python/toggle-debugpy-lines
  (:prefix "t"
   :desc "Copy python breakpoint" "b" #'+python/copy-pdb-breakpoint-of-current-line
   :desc "Copy python cmd" "p" #'+python/copy-python-cmd
   :desc "Copy pytest cmd" "y" #'+python/copy-pytest-cmd
   :desc "Copy unittest cmd" "u" #'+python/copy-unittest-cmd)
  (:prefix ("i" . "Import")
   :desc "Remove unused impoorts" "r" #'+python/autoflake-remove-imports
   :desc "Isort buffer"    "s" #'python-isort-autosave-mode
   :desc "Insert copied import" "p" #'+python/insert-temp-import
   :desc "Copy module import " "i" #'+python/yank-module-import)
  (:prefix ("v" . "ENV")
           "c" #'conda-env-activate
           "C" #'conda-env-deactivate
           "v" #'poetry-venv-toggle
           "P" #'pyvenv-workon
           "p" #'pyvenv-activate))
 (:after pyenv-mode
         (:map pyenv-mode-map
               "C-c C-s" nil
               "C-c C-u" nil)))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PYTHON
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(after! python
  (setq python-indent-offset 4
        python-shell-interpreter "python3"
        pippel-python-command "python3"
        flycheck-python-ruff-executable "ruff")
  (when (file-exists-p! "~/.conda")
    (setq conda-env-home-directory (expand-file-name "~/.conda")))

  ;; if you use pyton2, then you could comment the following 2 lines
  ;; (setq python-shell-interpreter "python2"
  ;;       python-shell-interpreter-args "-i")
  )
(add-hook! 'python-mode-hook #'+python/annotate-pdb)

(after! lsp-pylsp
  ;; disable live-mode for mypy
  (lsp-register-custom-settings `(("pylsp.plugins.pylsp_mypy.enabled" t)))
  (lsp-register-custom-settings `(("pylsp.plugins.pylsp_mypy.live_mode" t)))

  ;; ignore some linting info
  (setq lsp-pylsp-plugins-pycodestyle-ignore  [ "E501" ]
        lsp-pylsp-plugins-pylint-args [ "--errors-only" ]
        lsp-pylsp-plugins-black-enabled nil
        lsp-pylsp-plugins-flake8-enabled nil
        lsp-pylsp-plugins-isort-enabled nil
        lsp-pylsp-plugins-autopep8-enabled nil
        lsp-pylsp-plugins-yapf-enabled nil
        lsp-pylsp-plugins-ruff-enabled t
        lsp-pylsp-plugins-ruff-lineLength 100
        lsp-pylsp-plugins-ruff-format ["I"]
        lsp-pylsp-plugins-pyflakes-enabled nil
        lsp-pylsp-plugins-pycodestyle-enabled nil
        lsp-pylsp-plugins-pydocstyle-enabled nil
        lsp-pylsp-plugins-mccabe-enabled nil
        lsp-pylsp-plugins-mypy-enabled nil))

(use-package! py-isort
  :defer t
  :init
  (defvar my-enable-isort-before-save t)
  (defun my-python-isrot-before-save ()
    (when my-enable-isort-before-save
      (py-isort-before-save)))
  (define-minor-mode python-isort-autosave-mode
    "Isort autosave mode."
    :lighter " Isort"
    :global nil
    (when (not (derived-mode-p 'python-mode))
      (error "Isort only works with Python buffers"))
    (if python-isort-autosave-mode
        (add-hook! 'before-save-hook :local #'my-python-isrot-before-save)
      (remove-hook! 'before-save-hook :local #'my-python-isrot-before-save)))

  ;; (add-hook! 'python-mode-hook #'python-isort-autosave-mode)
  )


(after! pipenv
  (setq pipenv-with-projectile t)
  ;; Override pipenv--clean-response to trim color codes
  (defun pipenv--clean-response (response)
    "Clean up RESPONSE from shell command."
    (replace-regexp-in-string "\n\\[0m$" "" (s-chomp response)))

  ;; restart flycheck-mode after env activate and deactivate
  (dolist (func '(pipenv-activate pipenv-deactivate))
    (progn
      (when (modulep! :checkers syntax)
        (advice-add func :after #'reset-flycheck))
      (advice-add func :after #'+lsp/restart))))


(after! conda
  ;; restart flycheck-mode after env activate and deactivate
  (dolist (func '(conda-env-activate conda-env-deactivate))
    (progn
      (when (modulep! :checkers syntax)
        (advice-add func :after #'reset-flycheck))
      (advice-add func :after #'+lsp/restart))))

(after! poetry
  (remove-hook 'python-mode-hook #'poetry-tracking-mode)
  (dolist (func '(poetry-venv-workon poetry-venv-deactivate))
    (progn
      (when (modulep! :checkers syntax)
        (advice-add func :after #'reset-flycheck))
      (advice-add func :after #'+lsp/restart))))

;; For pytest-mode
(set-evil-initial-state! '(comint-mode) 'normal)


(after! dap-python
  (setq dap-python-executable "python3"
        dap-python-debugger 'debugpy))

#+end_src

**** packages.el
#+begin_src emacs-lisp :tangle "~/.config/doom/modules/private/my-python/packages.el" :mkdirp yes
;; -*- no-byte-compile: t; -*-
;;; private/my-python/packages.el

;; (package! importmagic)
(package! py-isort)

#+end_src

* Configuration
** Importing custom config files
#+begin_src emacs-lisp :tangle "~/.config/doom/config.el" :mkdirp yes
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

(load! "+os")
(load! "+git")
(load! "+misc")
(load! "+text")
(load! "+prog")
(load! "+ui")
(load! "+keys")
(cond
  ((modulep! :tools lsp +eglot) (load! "+eglot"))
  ((modulep! :tools lsp) (load! "+lsp")))

#+end_src

** Adding name and email
#+begin_src emacs-lisp :tangle "~/.config/doom/config.el" :mkdirp yes
(setq user-full-name "Mohamed Tarek"
      user-mail-address "mohamed96tarek@hotmail.com")
#+end_src

** Misc config
#+begin_src emacs-lisp :tangle "~/.config/doom/config.el" :mkdirp yes
(setq org-directory "~/org/")

(setq native-comp-jit-compilation t)

(setq doom-scratch-buffer-major-mode 'emacs-lisp-mode
      confirm-kill-emacs nil)

;; Delete the selection when pasting
(delete-selection-mode 1)

;; disable risky local variables warning
(advice-add 'risky-local-variable-p :override #'ignore)

(add-hook! 'find-file-hook #'+my/find-file-check-make-large-file-read-only-hook)

(setq clipetty-tmux-ssh-tty "tmux show-environment -g SSH_TTY")

;; check minified-file
(add-to-list 'magic-mode-alist (cons #'+my/check-minified-file 'fundamental-mode))

(set-popup-rules! '(("^\\*helpful" :size 0.35)
                    ("^\\*Ibuffer\\*$" :size 0.35)
                    ("^\\*info.*" :size 80 :side right)
                    ("^\\*Man.*" :size 80 :side right)
                    ("^\\*keycast.*" :size 50 :side right)
                    ("^\\*Customize" :actions display-buffer)
                    ("^\\*edit-indirect" :size 0.6)
                    ("^\\*YASnippet Tables\\*$" :size 0.35)
                    ("^\\*grep\\*$" :size 0.35)
                    ("^\\*pytest\\*" :size 0.35)
                    ("^\\*Anaconda\\*$" :size 0.35)
                    ("\\*.*server log\\*$" :side top :size 0.20 :select nil)
                    ((lambda (buf _) (with-current-buffer buf (eq major-mode 'forge-topic-mode))) :size 0.35)
                    ))

;; Manually edit .local/custom.el will break doom updates
(when (file-directory-p custom-file)
  (message (concat "Please delete " custom-file ". And customization in config.el and +ui.el.")))

(custom-set-variables
 '(warning-suppress-log-types '((lsp-mode) (iedit)))
 '(warning-suppress-types '((iedit))))

#+end_src

** UI Config
*** Setting fonts
#+begin_src emacs-lisp :tangle "~/.config/doom/+ui.el" :mkdirp yes
;;; private/my/+ui.el -*- lexical-binding: t; -*-

(setq doom-font (font-spec :family "FiraCode Nerd Font" :size 13 :weight 'semibold)
      doom-variable-pitch-font (font-spec :family "Rubik" :size 15 :weight 'medium)
      doom-symbol-font (font-spec :family "FiraCode Nerd Font" :size 13 :weight 'semibold))

(setq display-line-numbers-type 'relative)

(setq-default fill-column 120
              delete-trailing-lines t)
#+end_src

*** Emacs Window Setup
#+begin_src emacs-lisp :tangle "~/.config/doom/+ui.el" :mkdirp yes

(add-to-list 'default-frame-alist '(alpha-background . 85)) ; For all new frames henceforth
(add-to-list 'default-frame-alist '(fullscreen . maximized))
(add-to-list 'initial-frame-alist '(fullscreen . maximized))

(defun toggle-transparency ()
  (interactive)
  (let ((alpha (frame-parameter nil 'alpha)))
    (set-frame-parameter
     nil 'alpha
     (if (eql (cond ((numberp alpha) alpha)
                    ((numberp (cdr alpha)) (cdr alpha))
                    ;; Also handle undocumented (<active> <inactive>) form.
                    ((numberp (cadr alpha)) (cadr alpha)))
              100)
         '85 '100))))

#+end_src

*** Theme
#+begin_src emacs-lisp :tangle "~/.config/doom/+ui.el" :mkdirp yes

(setq doom-theme 'doom-gruvbox)
#+end_src

